.doom.d/config.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>GW&rsquo;s Doom Emacs Config</title>
<meta name="author" content="Gardner Berry"/>
<meta name="description" content="My personal Doom Emacs Configuration"/>
<meta name="mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-capable" content="yes">
<link rel="stylesheet" href="file:///Users/gb/Developer/git-repos/org-reveal-config/reveal.js/js/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="file:///Users/gb/Developer/git-repos/org-reveal-config/reveal.js/js/reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body prefix="dc: http://purl.org/dc/elements/1.1/ dcterms: http://purl.org/dc/terms/ dcmitype: http://purl.org/dc/dcmitype/ cc: http://creativecommons.org/ns# schema: http://schema.org/" typeof="dcmitype:InteractiveResource schema:PresentationDigitalDocument schema:LearningResource">
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">GW&rsquo;s Doom Emacs Config</h1><h2 class="author">Gardner Berry</h2><p class="date">Created: 2022-11-26 Sat 11:30</p>
</section>
<section id="table-of-contents-section">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#slide-orgeae3eb5">TABLE OF CONTENTS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc">toc</span></span></a></li>
<li><a href="#slide-org3d6dc83">ABOUT THIS CONFIG</a></li>
<li><a href="#slide-org7647018">BEACON</a></li>
<li><a href="#slide-orgc92cbf7">Setting Username and Email</a></li>
<li><a href="#slide-orgfb6c3d6">TITLE BAR</a></li>
<li><a href="#slide-orgbf22e90">DOOM THEME</a></li>
<li><a href="#slide-org4151ce2">SETTING THE DEFAULT LINK OPENER</a></li>
<li><a href="#slide-org7d1e84e">DIRED</a>
<ul>
<li><a href="#slide-org7b0f815">Keybindings To Open Dired</a></li>
<li><a href="#slide-org287f7c2">Keybindings Within Dired</a>
<ul>
<li><a href="#slide-orgaa4daa8">Basic dired commands</a></li>
<li><a href="#slide-org7c880b9">Dired commands using regex</a></li>
<li><a href="#slide-org947c30b">File permissions and ownership</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#slide-org4706c67">EMOJIS</a></li>
<li><a href="#slide-org79f396e">FONTS</a></li>
<li><a href="#slide-orgdace06c">INSERT DATE</a></li>
<li><a href="#slide-orgcf181bd">IVY</a>
<ul>
<li><a href="#slide-orge8bef72">IVY-POSFRAME</a></li>
<li><a href="#slide-org0827a32">IVY KEYBINDINGS</a></li>
</ul>
</li>
<li><a href="#slide-orge76777e">LINE SETTINGS</a></li>
<li><a href="#slide-orgbd728af">MARKDOWN</a></li>
<li><a href="#slide-org75e97a8">MODELINE</a></li>
<li><a href="#slide-org7dcb887">ORG MODE</a>
<ul>
<li><a href="#slide-org254e686">Org fonts</a></li>
<li><a href="#slide-orgc178fee">Org-export</a></li>
<li><a href="#slide-org1c238a5">Org-journal</a></li>
<li><a href="#slide-orgd7990e9">Org-publish</a></li>
<li><a href="#slide-org4632627">Org-auto-tangle</a></li>
<li><a href="#slide-orga53d691">Org-Roam</a></li>
<li><a href="#slide-orgd6ea0d5">Org-tree-slides</a></li>
<li><a href="#slide-orga95810d">Org-Re-Reveal</a></li>
</ul>
</li>
<li><a href="#slide-org721214c">EMACS-REVEAL</a></li>
<li><a href="#slide-org0897337">RAINBOW MODE</a></li>
<li><a href="#slide-org968cbb8">SWITCHING WINDOWS</a></li>
<li><a href="#slide-orgd037ff9">YASnippet</a></li>
<li><a href="#slide-orga981b8d">PALIMPSEST-MODE</a></li>
<li><a href="#slide-orgd404551">WEB-MODE</a></li>
<li><a href="#slide-org4e9283c">ERC</a></li>
<li><a href="#slide-orgd6adfb4">ELFEED</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgeae3eb5">
<h2 id="orgeae3eb5">TABLE OF CONTENTS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc">toc</span></span></h2>
<ul>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li><ul>
<li></li>
<li></li>

</ul></li>
<li></li>
<li></li>
<li></li>
<li><ul>
<li></li>
<li></li>

</ul></li>
<li></li>
<li></li>
<li></li>
<li><ul>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>

</ul></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>

</ul>

</section>
</section>
<section>
<section id="slide-org3d6dc83">
<h2 id="org3d6dc83">ABOUT THIS CONFIG</h2>

</section>
</section>
<section>
<section id="slide-org7647018">
<h2 id="org7647018">BEACON</h2>
<p>
Never lose your cursor.  When you scroll, your cursor will shine!  This is a global minor-mode. Turn it on everywhere with:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #6c71c4;">beacon-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgc92cbf7">
<h2 id="orgc92cbf7">Setting Username and Email</h2>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">user-full-name</span> <span style="color: #2aa198;">"Gardner Berry"</span>
    <span style="color: #6c71c4;">user-mail-address</span> <span style="color: #2aa198;">"berrygw06@gmail.com"</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgfb6c3d6">
<h2 id="orgfb6c3d6">TITLE BAR</h2>
<p>
Change the title bar format
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">frame-title-format</span> <span style="color: #2aa198;">"Hey bro, just FYI, this buffer is called %b or something like that."</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgbf22e90">
<h2 id="orgbf22e90">DOOM THEME</h2>
<p>
Setting the theme to doom-one.  To try out new themes, I set a keybinding for counsel-load-theme with &rsquo;SPC h t&rsquo;.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">doom-theme</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">doom-solarized-dark</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Load new theme"</span> <span style="color: #2aa198;">"h t"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">load-theme</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4151ce2">
<h2 id="org4151ce2">SETTING THE DEFAULT LINK OPENER</h2>
<p>
Setting in which browser EMACS will open links
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">browse-url-browser-function</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">browse-url-default-browser</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org7d1e84e">
<h2 id="org7d1e84e">DIRED</h2>
<p>
Dired is the file manager within Emacs.  Below, I setup keybindings for image previews (peep-dired).  Doom Emacs does not use &rsquo;SPC d&rsquo; for any of its keybindings, so I&rsquo;ve chosen the format of &rsquo;SPC d&rsquo; plus &rsquo;key&rsquo;.
</p>

</section>
</section>
<section>
<section id="slide-org7b0f815">
<h3 id="org7b0f815">Keybindings To Open Dired</h3>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dired</td>
<td class="org-left"><em>Open dired file manager</em></td>
<td class="org-left">SPC d d</td>
</tr>

<tr>
<td class="org-left">dired-jump</td>
<td class="org-left"><em>Jump to current directory in dired</em></td>
<td class="org-left">SPC d j</td>
</tr>
</tbody>
</table>

</section>
</section>
<section>
<section id="slide-org287f7c2">
<h3 id="org287f7c2">Keybindings Within Dired</h3>
<div class="outline-text-3" id="text-org287f7c2">
</div>
</section>
<section id="slide-orgaa4daa8">
<h4 id="orgaa4daa8">Basic dired commands</h4>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dired-view-file</td>
<td class="org-left"><em>View file in dired</em></td>
<td class="org-left">SPC d v</td>
</tr>

<tr>
<td class="org-left">dired-up-directory</td>
<td class="org-left"><em>Go up in directory tree</em></td>
<td class="org-left">h</td>
</tr>

<tr>
<td class="org-left">dired-find-file</td>
<td class="org-left"><em>Go down in directory tree (or open if file)</em></td>
<td class="org-left">l</td>
</tr>

<tr>
<td class="org-left">dired-next-line</td>
<td class="org-left">Move down to next line</td>
<td class="org-left">j</td>
</tr>

<tr>
<td class="org-left">dired-previous-line</td>
<td class="org-left">Move up to previous line</td>
<td class="org-left">k</td>
</tr>

<tr>
<td class="org-left">dired-mark</td>
<td class="org-left">Mark file at point</td>
<td class="org-left">m</td>
</tr>

<tr>
<td class="org-left">dired-unmark</td>
<td class="org-left">Unmark file at point</td>
<td class="org-left">u</td>
</tr>

<tr>
<td class="org-left">dired-do-copy</td>
<td class="org-left">Copy current file or marked files</td>
<td class="org-left">C</td>
</tr>

<tr>
<td class="org-left">dired-do-rename</td>
<td class="org-left">Rename current file or marked files</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-left">dired-hide-details</td>
<td class="org-left">Toggle detailed listings on/off</td>
<td class="org-left">(</td>
</tr>

<tr>
<td class="org-left">dired-git-info-mode</td>
<td class="org-left">Toggle git information on/off</td>
<td class="org-left">)</td>
</tr>

<tr>
<td class="org-left">dired-create-directory</td>
<td class="org-left">Create new empty directory</td>
<td class="org-left">+</td>
</tr>

<tr>
<td class="org-left">dired-diff</td>
<td class="org-left">Compare file at point with another</td>
<td class="org-left">=</td>
</tr>

<tr>
<td class="org-left">dired-subtree-toggle</td>
<td class="org-left">Toggle viewing subtree at point</td>
<td class="org-left">TAB</td>
</tr>
</tbody>
</table>

</section>
