.doom.d/config.html
<section id="slide-org7c880b9">
<h4 id="org7c880b9">Dired commands using regex</h4>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dired-mark-files-regexp</td>
<td class="org-left">Mark files using regex</td>
<td class="org-left">% m</td>
</tr>

<tr>
<td class="org-left">dired-do-copy-regexp</td>
<td class="org-left">Copy files using regex</td>
<td class="org-left">% C</td>
</tr>

<tr>
<td class="org-left">dired-do-rename-regexp</td>
<td class="org-left">Rename files using regex</td>
<td class="org-left">% R</td>
</tr>

<tr>
<td class="org-left">dired-mark-files-regexp</td>
<td class="org-left">Mark all files using regex</td>
<td class="org-left">* %</td>
</tr>
</tbody>
</table>

</section>
