.doom.d/config.html
<section id="slide-org947c30b">
<h4 id="org947c30b">File permissions and ownership</h4>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dired-do-chgrp</td>
<td class="org-left">Change the group of marked files</td>
<td class="org-left">g G</td>
</tr>

<tr>
<td class="org-left">dired-do-chmod</td>
<td class="org-left">Change the mode of marked files</td>
<td class="org-left">M</td>
</tr>

<tr>
<td class="org-left">dired-do-chown</td>
<td class="org-left">Change the owner of marked files</td>
<td class="org-left">O</td>
</tr>

<tr>
<td class="org-left">dired-do-rename</td>
<td class="org-left">Rename file or all marked files</td>
<td class="org-left">R</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:prefix</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">"d"</span> . <span style="color: #2aa198;">"dired"</span><span style="color: #859900;">)</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Open dired"</span> <span style="color: #2aa198;">"d"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">dired</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Dired jump to current"</span> <span style="color: #2aa198;">"j"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">dired-jump</span><span style="color: #d33682;">)</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:after</span> dired
       <span style="color: #859900;">(</span><span style="color: #268bd2;">:map</span> <span style="color: #6c71c4;">dired-mode-map</span>
        <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Peep-dired image previews"</span> <span style="color: #2aa198;">"d p"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">peep-dired</span>
        <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Dired view file"</span> <span style="color: #2aa198;">"d v"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">dired-view-file</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">evil-define-key</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #6c71c4;">dired-mode-map</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"M-RET"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-display-file</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"h"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-up-directory</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"l"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-open-file</span> <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">use dired-find-file instead of dired-open.</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"m"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-mark</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"t"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-toggle-marks</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"u"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-unmark</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"C"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-copy</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"D"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-delete</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"J"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-goto-file</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"M"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-chmod</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"O"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-chown</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"P"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-print</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"R"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-rename</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"T"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-touch</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"Y"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-copy-filenamecopy-filename-as-kill</span> <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">copies filename to kill ring.</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"Z"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-compress</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"+"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-create-directory</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"-"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-do-kill-lines</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"% l"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-downcase</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"% m"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-mark-files-regexp</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"% u"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-upcase</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"* %"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-mark-files-regexp</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"* ."</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-mark-extension</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"* /"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">dired-mark-directories</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"; d"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">epa-dired-do-decrypt</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"; e"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">epa-dired-do-encrypt</span><span style="color: #268bd2;">)</span>
<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Get file icons in dired</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-hook</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">dired-mode-hook</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">all-the-icons-dired-mode</span><span style="color: #268bd2;">)</span>
<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">With dired-open plugin, you can launch external programs for certain extensions</span>
<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">For example, I set all .png files to open in '</span><span style="color: #d33682; font-weight: bold; font-style: italic;">sxiv</span><span style="color: #405A61; font-style: italic;">' and all .mp4 files to open in '</span><span style="color: #d33682; font-weight: bold; font-style: italic;">mpv</span><span style="color: #405A61; font-style: italic;">'</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> dired-open-extensions <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"gif"</span> . <span style="color: #2aa198;">"sxiv"</span><span style="color: #859900;">)</span>
                              <span style="color: #859900;">(</span><span style="color: #2aa198;">"jpg"</span> . <span style="color: #2aa198;">"sxiv"</span><span style="color: #859900;">)</span>
                              <span style="color: #859900;">(</span><span style="color: #2aa198;">"png"</span> . <span style="color: #2aa198;">"sxiv"</span><span style="color: #859900;">)</span>
                              <span style="color: #859900;">(</span><span style="color: #2aa198;">"mkv"</span> . <span style="color: #2aa198;">"mpv"</span><span style="color: #859900;">)</span>
                              <span style="color: #859900;">(</span><span style="color: #2aa198;">"mp4"</span> . <span style="color: #2aa198;">"mpv"</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
