.doom.d/config.html
<section>
<section id="slide-org4706c67">
<h2 id="org4706c67">EMOJIS</h2>
<p>
Emojify is an Emacs extension to display emojis. It can display github style emojis like :smile: or plain ascii ones like :).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package</span> emojify
  <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span>after-init . <span style="color: #6c71c4;">global-emojify-mode</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org79f396e">
<h2 id="org79f396e">FONTS</h2>
<p>
Settings related to fonts within Doom Emacs:
</p>
<ul>
<li>&rsquo;doom-font&rsquo; &#x2013; standard monospace font that is used for most things in Emacs.</li>
<li>&rsquo;doom-variable-pitch-font&rsquo; &#x2013; variable font which is useful in some Emacs plugins.</li>
<li>&rsquo;doom-big-font&rsquo; &#x2013; used in doom-big-font-mode; useful for presentations.</li>
<li>&rsquo;font-lock-comment-face&rsquo; &#x2013; for comments.</li>
<li>&rsquo;font-lock-keyword-face&rsquo; &#x2013; for keywords with special significance like &rsquo;setq&rsquo; in elisp.</li>

</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">font-spec</span> <span style="color: #268bd2;">:family</span> <span style="color: #2aa198;">"JetBrains Mono"</span> <span style="color: #268bd2;">:size</span> <span style="color: #d33682; font-weight: bold;">15</span><span style="color: #d33682;">)</span>
      <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">font-spec</span> <span style="color: #268bd2;">:family</span> <span style="color: #2aa198;">"Ubuntu"</span> <span style="color: #268bd2;">:size</span> <span style="color: #d33682; font-weight: bold;">15</span><span style="color: #d33682;">)</span>
      <span style="color: #6c71c4;">doom-big-font</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">font-spec</span> <span style="color: #268bd2;">:family</span> <span style="color: #2aa198;">"JetBrains Mono"</span> <span style="color: #268bd2;">:size</span> <span style="color: #d33682; font-weight: bold;">24</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">after!</span> doom-themes
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">doom-themes-enable-bold</span> t
        <span style="color: #6c71c4;">doom-themes-enable-italic</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">custom-set-faces!</span>
  <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #6c71c4;">font-lock-comment-face</span> <span style="color: #268bd2;">:slant</span> italic<span style="color: #d33682;">)</span>
  <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #6c71c4;">font-lock-keyword-face</span> <span style="color: #268bd2;">:slant</span> italic<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgdace06c">
<h2 id="orgdace06c">INSERT DATE</h2>
<p>
Some custom functions to insert the date.  The function &rsquo;insert-todays-date&rsquo; can be used one of three different ways: (1) just the keybinding without the universal argument prefix, (2) with one universal argument prefix, or (3) with two universal argument prefixes.  The universal argument prefix is &rsquo;SPC-u&rsquo; in Doom Emacs (C-u in standard GNU Emacs).  The function &rsquo;insert-any-date&rsquo; only outputs to one format, which is the same format as &rsquo;insert-todays-date&rsquo; without a prefix.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">EXAMPLE OUTPUT</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">gw/insert-todays-date</td>
<td class="org-left">Friday, November 19, 2021</td>
<td class="org-left">SPC i d t</td>
</tr>

<tr>
<td class="org-left">gw/insert-todays-date</td>
<td class="org-left">11-19-2021</td>
<td class="org-left">SPC u SPC i d t</td>
</tr>

<tr>
<td class="org-left">gw/insert-todays-date</td>
<td class="org-left">2021-11-19</td>
<td class="org-left">SPC u SPC u SPC i d t</td>
</tr>

<tr>
<td class="org-left">gw/insert-any-date</td>
<td class="org-left">Friday, November 19, 2021</td>
<td class="org-left">SPC i d a</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/insert-todays-date</span> <span style="color: #d33682;">(</span>prefix<span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span> <span style="color: #2aa198;">"P"</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">let</span> <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">format</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">cond</span>
                 <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">not</span> prefix<span style="color: #859900;">)</span> <span style="color: #2aa198;">"%A, %B %d, %Y"</span><span style="color: #d33682;">)</span>
                 <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">equal</span> prefix <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">4</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span> <span style="color: #2aa198;">"%m-%d-%Y"</span><span style="color: #d33682;">)</span>
                 <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">equal</span> prefix <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">16</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span> <span style="color: #2aa198;">"%Y-%m-%d"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">insert</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">format-time-string</span> format<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">require</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682; font-weight: bold;">calendar</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/insert-any-date</span> <span style="color: #d33682;">(</span>date<span style="color: #d33682;">)</span>
  <span style="color: #35a69c; font-style: italic;">"Insert DATE using the current locale."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">list</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">calendar-read-date</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">insert</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">calendar-date-string</span> date<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:prefix</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">"i d"</span> . <span style="color: #2aa198;">"Insert date"</span><span style="color: #859900;">)</span>
        <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Insert any date"</span> <span style="color: #2aa198;">"a"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">gw/insert-any-date</span>
        <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Insert todays date"</span> <span style="color: #2aa198;">"t"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">gw/insert-todays-date</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgcf181bd">
<h2 id="orgcf181bd">IVY</h2>
<p>
Ivy is a generic completion mechanism for Emacs.
</p>

</section>
</section>
