.doom.d/config.html
<section>
<section id="slide-orge8bef72">
<h3 id="orge8bef72">IVY-POSFRAME</h3>
<p>
Ivy-posframe is an ivy extension, which lets ivy use posframe to show its candidate menu.  Some of the settings below involve:
</p>
<ul>
<li>ivy-posframe-display-functions-alist &#x2013; sets the display position for specific programs</li>
<li>ivy-posframe-height-alist &#x2013; sets the height of the list displayed for specific programs</li>

</ul>

<p>
Available functions (positions) for &rsquo;ivy-posframe-display-functions-alist&rsquo;
</p>
<ul>
<li>ivy-posframe-display-at-frame-center</li>
<li>ivy-posframe-display-at-window-center</li>
<li>ivy-posframe-display-at-frame-bottom-left</li>
<li>ivy-posframe-display-at-window-bottom-left</li>
<li>ivy-posframe-display-at-frame-bottom-window-center</li>
<li>ivy-posframe-display-at-point</li>
<li>ivy-posframe-display-at-frame-top-center</li>

</ul>

<p>
<code>NOTE:</code> If the setting for &rsquo;ivy-posframe-display&rsquo; is set to &rsquo;nil&rsquo; (false), anything that is set to &rsquo;ivy-display-function-fallback&rsquo; will just default to their normal position in Doom Emacs (usually a bottom split).  However, if this is set to &rsquo;t&rsquo; (true), then the fallback position will be centered in the window.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">ivy-posframe-display-functions-alist</span>
      <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #859900;">(</span>swiper                     . ivy-posframe-display-at-point<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">complete-symbol</span>            . ivy-posframe-display-at-point<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-M-x                . ivy-display-function-fallback<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-esh-history        . ivy-posframe-display-at-window-center<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-describe-function  . ivy-display-function-fallback<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-describe-variable  . ivy-display-function-fallback<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-find-file          . ivy-display-function-fallback<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-recentf            . ivy-display-function-fallback<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>counsel-register           . ivy-posframe-display-at-frame-bottom-window-center<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>dmenu                      . ivy-posframe-display-at-frame-top-center<span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>nil                        . ivy-posframe-display<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
      <span style="color: #6c71c4;">ivy-posframe-height-alist</span>
      <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #859900;">(</span>swiper . <span style="color: #d33682; font-weight: bold;">20</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>dmenu . <span style="color: #d33682; font-weight: bold;">20</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>t . <span style="color: #d33682; font-weight: bold;">10</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #6c71c4;">ivy-posframe-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #268bd2;">)</span> <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">1 enables posframe-mode, 0 disables it.</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org0827a32">
<h3 id="org0827a32">IVY KEYBINDINGS</h3>
<p>
By default, Doom Emacs does not use &rsquo;SPC v&rsquo;, so the format I use for these bindings is &rsquo;SPC v&rsquo; plus &rsquo;key&rsquo;.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:prefix</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">"v"</span> . <span style="color: #2aa198;">"Ivy"</span><span style="color: #859900;">)</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Ivy push view"</span> <span style="color: #2aa198;">"v p"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">ivy-push-view</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Ivy switch view"</span> <span style="color: #2aa198;">"v s"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">ivy-switch-view</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orge76777e">
<h2 id="orge76777e">LINE SETTINGS</h2>
<p>
I set comment-line to &rsquo;SPC TAB TAB&rsquo; which is a rather comfortable keybinding for me on my ZSA Moonlander keyboard.  The standard Emacs keybinding for comment-line is &rsquo;C-x C-;&rsquo;.  The other keybindings are for commands that toggle on/off various line-related settings.  Doom Emacs uses &rsquo;SPC t&rsquo; for &ldquo;toggle&rdquo; commands, so I choose &rsquo;SPC t&rsquo; plus &rsquo;key&rsquo; for those bindings.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">comment-line</td>
<td class="org-left"><em>Comment or uncomment lines</em></td>
<td class="org-left">SPC TAB TAB</td>
</tr>

<tr>
<td class="org-left">hl-line-mode</td>
<td class="org-left"><em>Toggle line highlighting in current frame</em></td>
<td class="org-left">SPC t h</td>
</tr>

<tr>
<td class="org-left">global-hl-line-mode</td>
<td class="org-left"><em>Toggle line highlighting globally</em></td>
<td class="org-left">SPC t H</td>
</tr>

<tr>
<td class="org-left">doom/toggle-line-numbers</td>
<td class="org-left"><em>Toggle line numbers</em></td>
<td class="org-left">SPC t l</td>
</tr>

<tr>
<td class="org-left">toggle-truncate-lines</td>
<td class="org-left"><em>Toggle truncate lines</em></td>
<td class="org-left">SPC t t</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">display-line-numbers-type</span> t<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Comment or uncomment lines"</span> <span style="color: #2aa198;">"TAB TAB"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">comment-line</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:prefix</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">"t"</span> . <span style="color: #2aa198;">"toggle"</span><span style="color: #859900;">)</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Toggle line numbers"</span> <span style="color: #2aa198;">"l"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">doom/toggle-line-numbers</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Toggle line highlight in frame"</span> <span style="color: #2aa198;">"h"</span> <span style="color: #cb4b16;">#'</span><span style="color: #6c71c4;">hl-line-mode</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Toggle line highlight globally"</span> <span style="color: #2aa198;">"H"</span> <span style="color: #cb4b16;">#'</span><span style="color: #6c71c4;">global-hl-line-mode</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Toggle truncate lines"</span> <span style="color: #2aa198;">"t"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">toggle-truncate-lines</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
