.doom.d/config.html
<section>
<section id="slide-orgbd728af">
<h2 id="orgbd728af">MARKDOWN</h2>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">custom-set-faces</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> <span style="color: #6c71c4;">font-lock-function-name-face</span> <span style="color: #268bd2;">:weight</span> bold <span style="color: #268bd2;">:family</span> <span style="color: #2aa198;">"variable-pitch"</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-1 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.7</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-2 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.6</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-3 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.5</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-4 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.4</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-5 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.3</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
 <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdown-header-face-6 <span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>t <span style="color: #268bd2;">(</span><span style="color: #268bd2;">:inherit</span> markdown-header-face <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.2</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

</pre>
</div>

</section>
</section>
<section>
<section id="slide-org75e97a8">
<h2 id="org75e97a8">MODELINE</h2>
<p>
The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
<a href="https://github.com/seagle0128/doom-modeline" rel="noopenener noreferrer" target="_blank">https://github.com/seagle0128/doom-modeline</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">mode-line</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #2aa198;">"Ubuntu Mono-18"</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">doom-modeline-height</span> <span style="color: #d33682; font-weight: bold;">50</span>     <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">sets modeline height</span>
      <span style="color: #6c71c4;">doom-modeline-bar-width</span> <span style="color: #d33682; font-weight: bold;">5</span>   <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">sets right bar width</span>
      <span style="color: #6c71c4;">doom-modeline-persp-name</span> t  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">adds perspective name to modeline</span>
      <span style="color: #6c71c4;">doom-modeline-persp-icon</span> t<span style="color: #268bd2;">)</span> <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">adds folder icon next to persp name</span>
<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Count words</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">doom-modeline-enable-word-count</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span>markdow-mode gfm-mode org-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Display battery</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> doom-modeline-enable-battery t<span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
