.doom.d/config.html
<section>
<section id="slide-org7dcb887">
<h2 id="org7dcb887">ORG MODE</h2>
<p>
I wrapped most of this block in (after! org).  Without this, my settings might be evaluated too early, which will result in my settings being overwritten by Doom&rsquo;s defaults.  I have also enabled org-journal, org-superstar and org-roam by adding (+journal +pretty +roam2) to the org section of my Doom Emacs init.el.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Org babel tangle"</span> <span style="color: #2aa198;">"m B"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">org-babel-tangle</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">after!</span> org
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-directory</span> <span style="color: #2aa198;">"~/Documents/"</span>
        <span style="color: #6c71c4;">org-agenda-files</span> <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"~/Documents/agenda.org"</span><span style="color: #859900;">)</span>
        <span style="color: #6c71c4;">org-default-notes-file</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">expand-file-name</span> <span style="color: #2aa198;">"notes.org"</span> <span style="color: #6c71c4;">org-directory</span><span style="color: #859900;">)</span>
        <span style="color: #6c71c4;">org-ellipsis</span> <span style="color: #2aa198;">" &#9660; "</span>
        <span style="color: #6c71c4;">org-superstar-headline-bullets-list</span> <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"&#9673;"</span> <span style="color: #2aa198;">"&#9679;"</span> <span style="color: #2aa198;">"&#9675;"</span> <span style="color: #2aa198;">"&#9670;"</span> <span style="color: #2aa198;">"&#9679;"</span> <span style="color: #2aa198;">"&#9675;"</span> <span style="color: #2aa198;">"&#9670;"</span><span style="color: #859900;">)</span>
        org-superstar-itembullet-alist <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>?+ . ?&#10148;<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>?- . ?&#10022;<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span> <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">changes +/- symbols in item lists</span>
        <span style="color: #6c71c4;">org-log-done</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">time</span>
        <span style="color: #6c71c4;">org-hide-emphasis-markers</span> t
        <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">ex. of org-link-abbrev-alist in action</span>
        <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">[[arch-wiki:Name_of_Page][Description]]</span>
        <span style="color: #6c71c4;">org-link-abbrev-alist</span>    <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">This overwrites the default Doom org-link-abbrev-list</span>
          <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"google"</span> . <span style="color: #2aa198;">"http://www.google.com/search?q="</span><span style="color: #6c71c4;">)</span>
            <span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"arch-wiki"</span> . <span style="color: #2aa198;">"https://wiki.archlinux.org/index.php/"</span><span style="color: #6c71c4;">)</span>
            <span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"ddg"</span> . <span style="color: #2aa198;">"https://duckduckgo.com/?q="</span><span style="color: #6c71c4;">)</span>
            <span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"wiki"</span> . <span style="color: #2aa198;">"https://en.wikipedia.org/wiki/"</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
        <span style="color: #6c71c4;">org-table-convert-region-max-lines</span> <span style="color: #d33682; font-weight: bold;">20000</span>
        <span style="color: #6c71c4;">org-todo-keywords</span>        <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">This overwrites the default Doom org-todo-keywords</span>
          <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>sequence
             <span style="color: #2aa198;">"</span><span style="color: #b58900; font-weight: bold;">TODO</span><span style="color: #2aa198;">(t)"</span>           <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">A task that is ready to be tackled</span>
             <span style="color: #2aa198;">"BLOG(b)"</span>           <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Blog writing assignments</span>
             <span style="color: #2aa198;">"GYM(g)"</span>            <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Things to accomplish at the gym</span>
             <span style="color: #2aa198;">"PROJ(p)"</span>           <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">A project that contains other tasks</span>
             <span style="color: #2aa198;">"VIDEO(v)"</span>          <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Video assignments</span>
             <span style="color: #2aa198;">"WAIT(w)"</span>           <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Something is holding up this task</span>
             <span style="color: #2aa198;">"|"</span>                 <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">The pipe necessary to separate "active" states and "inactive" states</span>
             <span style="color: #2aa198;">"DONE(d)"</span>           <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Task has been completed</span>
             <span style="color: #2aa198;">"CANCELLED(c)"</span> <span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span> <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Task has been cancelled</span>
</pre>
</div>

</section>
</section>
