.doom.d/config.html
<section>
<section id="slide-org254e686">
<h3 id="org254e686">Org fonts</h3>
<p>
I have created an interactive function for each color scheme (M-x gw/org-colors-*).  These functions will set appropriate colors and font attributes for org-level fonts and the org-table font.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-doom-one</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Doom One colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #51afef;">#51afef</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #c678dd;">#c678dd</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #98be65;">#98be65</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #da8548;">#da8548</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #5699af;">#5699af</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #a9a1e1;">#a9a1e1</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #46d9ff;">#46d9ff</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ff6c6b;">#ff6c6b</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-dracula</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Dracula colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #8be9fd;">#8be9fd</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bd93f9;">#bd93f9</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #50fa7b;">#50fa7b</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ff79c6;">#ff79c6</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #9aedfe;">#9aedfe</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #caa9fa;">#caa9fa</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #5af78e;">#5af78e</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ff92d0;">#ff92d0</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-gruvbox-dark</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Gruvbox Dark colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #458588;">#458588</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #b16286;">#b16286</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #98971a;">#98971a</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #fb4934;">#fb4934</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #83a598;">#83a598</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #d3869b;">#d3869b</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #d79921;">#d79921</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #8ec07c;">#8ec07c</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-monokai-pro</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Monokai Pro colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #78dce8;">#78dce8</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ab9df2;">#ab9df2</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #a9dc76;">#a9dc76</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #fc9867;">#fc9867</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ff6188;">#ff6188</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ffd866;">#ffd866</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #78dce8;">#78dce8</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ab9df2;">#ab9df2</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-nord</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Nord colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #81a1c1;">#81a1c1</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b48ead;">#b48ead</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #a3be8c;">#a3be8c</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ebcb8b;">#ebcb8b</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #bf616a;">#bf616a</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #88c0d0;">#88c0d0</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #81a1c1;">#81a1c1</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b48ead;">#b48ead</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-oceanic-next</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Oceanic Next colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #6699cc;">#6699cc</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #c594c5;">#c594c5</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #99c794;">#99c794</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #fac863;">#fac863</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #5fb3b3;">#5fb3b3</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #ec5f67;">#ec5f67</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #6699cc;">#6699cc</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #c594c5;">#c594c5</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-palenight</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Palenight colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #82aaff;">#82aaff</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #c792ea;">#c792ea</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #c3e88d;">#c3e88d</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ffcb6b;">#ffcb6b</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #a3f7ff;">#a3f7ff</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #e1acff;">#e1acff</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #f07178;">#f07178</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #ddffa7;">#ddffa7</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-solarized-dark</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Solarized Dark colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #268bd2;">#268bd2</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #d33682;">#d33682</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #859900;">#859900</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b58900;">#b58900</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #cb4b16;">#cb4b16</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #6c71c4;">#6c71c4</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #2aa198;">#2aa198</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #657b83;">#657b83</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-solarized-light</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Solarized Light colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #268bd2;">#268bd2</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #d33682;">#d33682</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #859900;">#859900</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b58900;">#b58900</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #cb4b16;">#cb4b16</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #6c71c4;">#6c71c4</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #2aa198;">#2aa198</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #657b83;">#657b83</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">gw/org-colors-tomorrow-night</span> <span style="color: #d33682;">()</span>
  <span style="color: #35a69c; font-style: italic;">"Enable Tomorrow Night colors for Org headers."</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">interactive</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">dolist</span>
      <span style="color: #859900;">(</span>face
       <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span>org-level-1 <span style="color: #d33682; font-weight: bold;">1.7</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #81a2be;">#81a2be</span><span style="color: #2aa198;">"</span> ultra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-2 <span style="color: #d33682; font-weight: bold;">1.6</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b294bb;">#b294bb</span><span style="color: #2aa198;">"</span> extra-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-3 <span style="color: #d33682; font-weight: bold;">1.5</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b5bd68;">#b5bd68</span><span style="color: #2aa198;">"</span> bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-4 <span style="color: #d33682; font-weight: bold;">1.4</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #e6c547;">#e6c547</span><span style="color: #2aa198;">"</span> semi-bold<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-5 <span style="color: #d33682; font-weight: bold;">1.3</span> <span style="color: #2aa198;">"</span><span style="color: #ffffff; background-color: #cc6666;">#cc6666</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-6 <span style="color: #d33682; font-weight: bold;">1.2</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #70c0ba;">#70c0ba</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-7 <span style="color: #d33682; font-weight: bold;">1.1</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #b77ee0;">#b77ee0</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span>
         <span style="color: #268bd2;">(</span>org-level-8 <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #9ec400;">#9ec400</span><span style="color: #2aa198;">"</span> normal<span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">0</span> face<span style="color: #6c71c4;">)</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-variable-pitch-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">3</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:height</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">1</span> face<span style="color: #6c71c4;">)</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">nth</span> <span style="color: #d33682; font-weight: bold;">2</span> face<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
    <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">set-face-attribute</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-table</span> nil <span style="color: #268bd2;">:font</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">normal</span> <span style="color: #268bd2;">:height</span> <span style="color: #d33682; font-weight: bold;">1.0</span> <span style="color: #268bd2;">:foreground</span> <span style="color: #2aa198;">"</span><span style="color: #000000; background-color: #bfafdf;">#bfafdf</span><span style="color: #2aa198;">"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Load our desired dt/org-colors-* theme on startup</span>
<span style="color: #268bd2;">(</span><span style="color: #268bd2;">gw/org-colors-doom-one</span><span style="color: #268bd2;">)</span>

</pre>
</div>

</section>
</section>
