.doom.d/config.html
<section>
<section id="slide-orgc178fee">
<h3 id="orgc178fee">Org-export</h3>
<p>
We need ox-man for &ldquo;Org eXporting&rdquo; to manpage format and ox-gemini for exporting to gemtext (for the gemini protocol).
</p>

<p>
<code>NOTE</code>: I also enable ox-publish for converting an Org site into an HTML site, but that is done in init.el (org +publish).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package</span> ox-twbs<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package</span> ox-re-reveal<span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org1c238a5">
<h3 id="org1c238a5">Org-journal</h3>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> org-journal-dir <span style="color: #2aa198;">"~/nc/Org/journal/"</span>
      org-journal-date-prefix <span style="color: #2aa198;">"* "</span>
      org-journal-time-prefix <span style="color: #2aa198;">"** "</span>
      org-journal-date-format <span style="color: #2aa198;">"%B %d, %Y (%A) "</span>
      org-journal-file-format <span style="color: #2aa198;">"%Y-%m-%d.org"</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
