.doom.d/config.html
<section>
<section id="slide-orgd7990e9">
<h3 id="orgd7990e9">Org-publish</h3>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-publish-use-timestamps-flag</span> nil<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-export-with-broken-links</span> t<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-publish-project-alist</span>
      <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"distro.tube without manpages"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:exclude</span> <span style="color: #2aa198;">"org-html-themes/.*</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">man-org/man*"</span>
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man0p"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man0p/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man0p/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man1"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man1/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man1/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man1p"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man1p/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man1p/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man2"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man2/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man2/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man3"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man3/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man3/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man3p"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man3p/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man3p/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man4"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man4/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man4/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man5"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man5/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man5/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man6"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man6/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man6/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man7"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man7/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man7/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"man8"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/man-org/man8/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/distro.tube/html/man-org/man8/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"org-static"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/Org/website"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"css</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">js</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">png</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">jpg</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">gif</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">pdf</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">mp3</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">ogg</span><span style="color: #cb4b16; font-weight: bold;">\\</span><span style="color: #cb4b16; font-weight: bold;">|</span><span style="color: #2aa198;">swf"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/public_html/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:exclude</span> <span style="color: #2aa198;">".*/org-html-themes/.*"</span>
         <span style="color: #268bd2;">:publishing-function</span> org-publish-attachment<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"dtos.dev"</span>
         <span style="color: #268bd2;">:base-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/dtos.dev/"</span>
         <span style="color: #268bd2;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2;">:publishing-directory</span> <span style="color: #2aa198;">"~/nc/gitlab-repos/dtos.dev/html/"</span>
         <span style="color: #268bd2;">:recursive</span> t
         <span style="color: #268bd2;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #268bd2;">:headline-levels</span> <span style="color: #d33682; font-weight: bold;">4</span>             <span style="color: #405A61; font-style: italic;">; </span><span style="color: #405A61; font-style: italic;">Just the default for this project.</span>
         <span style="color: #268bd2;">:auto-preamble</span> t<span style="color: #859900;">)</span>

      <span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
