.doom.d/config.html
<section>
<section id="slide-org4632627">
<h3 id="org4632627">Org-auto-tangle</h3>
<p>
<code>org-auto-tangle</code> allows you to add the option <code>#+auto_tangle: t</code> in your Org file so that it automatically tangles when you save the document.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package!</span> org-auto-tangle
  <span style="color: #268bd2;">:defer</span> t
  <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">org-mode</span> . org-auto-tangle-mode<span style="color: #d33682;">)</span>
  <span style="color: #268bd2;">:config</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> org-auto-tangle-default t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

</pre>
</div>

</section>
</section>
<section>
<section id="slide-orga53d691">
<h3 id="orga53d691">Org-Roam</h3>
</section>
</section>
<section>
<section id="slide-orgd6ea0d5">
<h3 id="orgd6ea0d5">Org-tree-slides</h3>
<p>
Customizations for Org-tree-slides.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package</span> hide-mode-line<span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">efs/presentation-setup</span> <span style="color: #d33682;">()</span>
  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Hide the mode line</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4;">hide-mode-line-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #d33682;">)</span>

  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Display images inline</span>
  <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">org-display-inline-images</span><span style="color: #d33682;">)</span> <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Can also use org-startup-with-inline-images</span>

  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Scale the text.  The next line is for basic scaling:</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">text-scale-mode-amount</span> <span style="color: #d33682; font-weight: bold;">3</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4;">text-scale-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">This option is more advanced, allows you to scale other faces too</span>
  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">(setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)</span>
  <span style="color: #405A61; font-style: italic;">;;                                    </span><span style="color: #405A61; font-style: italic;">(org-verbatim (:height 1.75) org-verbatim)</span>
  <span style="color: #405A61; font-style: italic;">;;                                    </span><span style="color: #405A61; font-style: italic;">(org-block (:height 1.25) org-block))))</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">defun</span> <span style="color: #268bd2;">efs/presentation-end</span> <span style="color: #d33682;">()</span>
  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Show the mode line again</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4;">hide-mode-line-mode</span> <span style="color: #d33682; font-weight: bold;">0</span><span style="color: #d33682;">)</span>

  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">Turn off text scale mode (or use the next line if you didn't use text-scale-mode)</span>
  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">(text-scale-mode 0))</span>

  <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">If you use face-remapping-alist, this clears the scaling:</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq-local</span> <span style="color: #6c71c4;">face-remapping-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span><span style="color: #6c71c4;">(</span>default variable-pitch default<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">use-package</span> org-tree-slide
  <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span>org-tree-slide-play . efs/presentation-setup<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span>org-tree-slide-stop . efs/presentation-end<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #268bd2;">:custom</span>
  <span style="color: #d33682;">(</span>org-tree-slide-slide-in-effect t<span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>org-tree-slide-activate-message <span style="color: #2aa198;">"Presentation started!"</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>org-tree-slide-deactivate-message <span style="color: #2aa198;">"Presentation finished!"</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>org-tree-slide-header t<span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>org-tree-slide-breadcrumbs <span style="color: #2aa198;">" &gt; "</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span><span style="color: #6c71c4;">org-image-actual-width</span> nil<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orga95810d">
<h3 id="orga95810d">Org-Re-Reveal</h3>
<p>
Org-Reveal is a package that allows you to export your org documents to Reveal.js to make pretty presentations.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-re-reveal-root</span> <span style="color: #2aa198;">"file:///Users/gb/Developer/git-repos/org-reveal-config/reveal.js/js/reveal.js"</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">org-re-reveal-hlevel</span> <span style="color: #d33682; font-weight: bold;">2</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org721214c">
<h2 id="org721214c">EMACS-REVEAL</h2>
<p>
This repository provides emacs-reveal, which is
free/libre and open source software (FLOSS)
to create Open Educational Resources (OER)
in the form of reveal.js presentations (HTML
slides with audio).  As the name suggests, emacs-reveal is based on
the text editor GNU Emacs.
More specifically, authors write their OER in a lightweight markup
language called Org mode, which is native to
GNU Emacs but can be edited everywhere (as text file; also with
real support in other editors)
and which allows authors (a) to
collaborate on source documents via version control systems such as
Git and (b) to focus on contents, while layout information is
maintained separately.  Org files can then be exported to various
target formats (e.g., reveal.js presentations or PDF documents).
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">load-path</span> <span style="color: #2aa198;">"~/Documents/emacs-stuff/emacs-reveal"</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">require</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682; font-weight: bold;">emacs-reveal</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org0897337">
<h2 id="org0897337">RAINBOW MODE</h2>
<p>
Rainbox mode displays the actual color for any hex value color.  It&rsquo;s such a nice feature that I wanted it turned on all the time, regardless of what mode I am in.  The following creates a global minor mode for rainbow-mode and enables it (exception: org-agenda-mode since rainbow-mode destroys all highlighting in org-agenda).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">define-globalized-minor-mode</span> <span style="color: #6c71c4;">global-rainbow-mode</span> <span style="color: #6c71c4;">rainbow-mode</span>
  <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">lambda</span> <span style="color: #859900;">()</span>
    <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">when</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">not</span> <span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">memq</span> <span style="color: #6c71c4;">major-mode</span>
                <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">list</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">org-agenda-mode</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">rainbow-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #6c71c4;">global-rainbow-mode</span> <span style="color: #d33682; font-weight: bold;">1</span> <span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
