.doom.d/config.html
<section>
<section id="slide-org968cbb8">
<h2 id="org968cbb8">SWITCHING WINDOWS</h2>
<p>
Here is where I set my keybindings for switching between windows.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">global-set-key</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">kbd</span> <span style="color: #2aa198;">"M-b"</span><span style="color: #d33682;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">ace-window</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd037ff9">
<h2 id="orgd037ff9">YASnippet</h2>
<p>
YASnippet is a tool that allows you to create templates do allow you to write less boilerplate when starting documents.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> <span style="color: #6c71c4;">yas-snippet-dirs</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"~/Documents/emacs-stuff/snippets"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #6c71c4;">yas-global-mode</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orga981b8d">
<h2 id="orga981b8d">PALIMPSEST-MODE</h2>
<p>
This minor mode for Emacs provides several strategies to remove text without permanently deleting it. Namely, it provides the following capabilities:
</p>

<p>
Send selected text to the bottom of the buffer
Send selected text to the top of the buffer
Send selected text to a trash file
</p>

<p>
Much like code, the process of writing text is a progression of revisions where content gets transformed and refined. During these iterations, it is often desirable to move text instead of deleting it: you may have written a sentence that doesn&rsquo;t belong in the paragraph you&rsquo;re editing right now, but it might fit somewhere else. Since you don&rsquo;t know where exactly, you&rsquo;d like to put it out of the way, not discard it entirely. Palimpsest saves you from the traveling back and forth between your current position and the bottom of your document (or another draft or trash document).
</p>

<p>
Next time you&rsquo;re writing fiction, non-fiction, a journalistic piece or a blog post using Emacs, give palimpsest-mode a try. You might even try it while coding in a functional language, moving stuff around sprightly, aided by an abstraction reminiscent of the Read-Eval-Print loop, yet completely orthogonal.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #405A61; font-style: italic;">;;</span><span style="color: #405A61; font-style: italic;">This is where I will change the keybindings to Palemcest-mode if I remember.</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd404551">
<h2 id="orgd404551">WEB-MODE</h2>
<p>
These are my hooks for web-mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.html\\'"</span> .web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.phtml\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.tpl\\.php\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.[agj]sp\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.as[cp]x\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.erb\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.mustache\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">add-to-list</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">auto-mode-alist</span> <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"\\.djhtml\\'"</span> . web-mode<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org4e9283c">
<h2 id="org4e9283c">ERC</h2>
<p>
ERC is a built-in Emacs IRC client.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">map!</span> <span style="color: #268bd2;">:leader</span>
      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:prefix</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">"e"</span>. <span style="color: #2aa198;">"evaluate/ERC/EWW"</span><span style="color: #859900;">)</span>
       <span style="color: #268bd2;">:desc</span> <span style="color: #2aa198;">"Launch ERC with TLS connection"</span> <span style="color: #2aa198;">"E"</span> <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">erc-tls</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">setq</span> erc-prompt <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold; font-style: italic;">lambda</span> <span style="color: #859900;">()</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">concat</span> <span style="color: #2aa198;">"["</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">buffer-name</span><span style="color: #6c71c4;">)</span> <span style="color: #2aa198;">"]"</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
      erc-server <span style="color: #2aa198;">"irc.libera.chat"</span>
      erc-nick <span style="color: #2aa198;">"Game-Warrior"</span>
      erc-user-full-name <span style="color: #2aa198;">"Gardner Berry"</span>
      erc-track-shorten-start <span style="color: #d33682; font-weight: bold;">24</span>
      erc-autojoin-channels-alist <span style="color: #cb4b16;">'</span><span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"irc.libera.chat"</span> <span style="color: #2aa198;">"#archlinux"</span> <span style="color: #2aa198;">"#linux"</span> <span style="color: #2aa198;">"#emacs #emacsconf #emacsconf-gen"</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
      erc-kill-buffer-on-part t
      erc-fill-column <span style="color: #d33682; font-weight: bold;">100</span>
      erc-fill-function <span style="color: #cb4b16;">'</span><span style="color: #b58900;">erc-fill-static</span>
      erc-fill-static-center <span style="color: #d33682; font-weight: bold;">20</span>
      <span style="color: #405A61; font-style: italic;">;; </span><span style="color: #405A61; font-style: italic;">erc-auto-query 'bury</span>
      <span style="color: #268bd2;">)</span>

</pre>
</div>

</section>
</section>
